### 5. 인덱스 조작

In [2]:
import numpy as np
import pandas as pd

- 인덱스 설정 및 제거

In [3]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                              columns=["C1", "C2", "C3", "C4"])

df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [5]:
df2 = df1.set_index('C1')           # df1.set_index('C1', inplace=True)
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [6]:
df1.index, df2.index

(RangeIndex(start=0, stop=5, step=1),
 Index(['A', 'B', 'C', 'D', 'E'], dtype='object', name='C1'))

In [7]:
df3= df2.set_index('C2')
df3

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [8]:
df2.reset_index(inplace=True)
df2

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

- 연습 문제 4.5.1

In [15]:

# 5명의 학생이 국어 영어 수학 점수를 나타내는 데이터 프레임을 다음과 같이 만든다.

# 1. 학생 이름을 나타내는 열을 포함시키지 않고 데이터 프레임 df_score을 생성한 후

df_score1 = pd.DataFrame(np.random.randint(60,101, size=(5,3)),
                         columns=['국어', '영어', '수학'])
df_score1

   국어  영어  수학
0  96  83  66
1  84  84  72
2  61  98  99
3  83  84  77
4  97  85  73

In [18]:
df_score1.index = ['제임스','마리아','파이썬','홍길동','최자바']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
제임스  96  83  66
마리아  84  84  72
파이썬  61  98  99
홍길동  83  84  77
최자바  97  85  73

In [21]:
df_score2 = df_score1
df_score2

     국어  영어  수학
이름
제임스  96  83  66
마리아  84  84  72
파이썬  61  98  99
홍길동  83  84  77
최자바  97  85  73

In [1]:
df_score2.set_index('이름', inplace= True)
df_score2

NameError: name 'df_score2' is not defined

- 다중 인덱스

In [7]:
np.random.seed(0)
df3 = pd.DataFrame(np.round([list('ABCDE'),
                            np.round(np.random.rand(5, 4), 2)]),
                            columns=["A", "A", "B", "B"]
                                    ["C1", "C2", "C3", "C4"])

df3

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1939517329.py, line 2)

In [ ]:
df3.columns.names = ['Cidx1','Cidx2']
df3

In [4]:
df3['A', 'C1']

NameError: name 'df3' is not defined

In [8]:
# 0.41 값을 인덱싱
df4['A', 'D']['M','id_3']

NameError: name 'df4' is not defined

In [9]:
df4.iloc[2,1]

NameError: name 'df4' is not defined